tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4450_tdd.h
#define TRISE                         522
#define TRISE_RE0                     523
#define TRISE0                        524
#define TRISE_RE1                     525
#define TRISE1                        526
#define TRISE_RE2                     527
#define TRISE2                        528
#define PIE1                          529
#define TMR1IE                        530
#define TMR2IE                        531
#define CCP1IE                        532
#define TXIE                          533
#define TX1IE                         534
#define RCIE                          535
#define RC1IE                         536
#define ADIE                          537
#define PIR1                          538
#define TMR1IF                        539
#define TMR2IF                        540
#define CCP1IF                        541
#define TXIF                          542
#define TX1IF                         543
#define RCIF                          544
#define RC1IF                         545
#define ADIF                          546
#define IPR1                          547
#define TMR1IP                        548
#define TMR2IP                        549
#define CCP1IP                        550
#define TX1IP                         551
#define TXIP                          552
#define RCIP                          553
#define RC1IP                         554
#define ADIP                          555
#define PIE2                          556
#define LVDIE                         557
#define HLVDIE                        558
#define USBIE                         559
#define OSCFIE                        560
#define PIR2                          561
#define HLVDIF                        562
#define LVDIF                         563
#define USBIF                         564
#define OSCFIF                        565
#define IPR2                          566
#define LVDIP                         567
#define HLVDIP                        568
#define USBIP                         569
#define OSCFIP                        570
#define EECON1                        571
#define WR                            572
#define WREN                          573
#define WRERR                         574
#define FREE                          575
#define CFGS                          576
#define EEFS                          577
#define RCSTA                         578
#define RCD8                          579
#define RX9D                          580
#define OERR                          581
#define FERR                          582
#define ADDEN                         583
#define ADEN                          584
#define CREN                          585
#define SRENA                         586
#define SREN                          587
#define RC9                           588
#define RC8_9                         589
#define RX9                           590
#define SPEN                          591
#define TXSTA                         592
#define TXD8                          593
#define TX9D1                         594
#define TX9D                          595
#define TRMT                          596
#define TRMT1                         597
#define BRGH1                         598
#define BRGH                          599
#define SENDB1                        600
#define SENDB                         601
#define SYNC                          602
#define SYNC1                         603
#define TXEN1                         604
#define TXEN                          605
#define TX91                          606
#define TX8_9                         607
#define TX9                           608
#define CSRC1                         609
#define CSRC                          610
#define BAUDCON                       611
#define ABDEN                         612
#define W4E                           613
#define WUE                           614
#define BRG16                         615
#define TXCKP                         616
#define SCKP                          617
#define RXCKP                         618
#define RXDTP                         619
#define RCMT                          620
#define RCIDL                         621
#define ABDOVF                        622
#define CCP1CON                       623
#define CCP1M0                        624
#define CCP1M                         625
#define CCP1M1                        626
#define CCP1M2                        627
#define CCP1M3                        628
#define DC1B                          629
#define DC1B0                         630
#define DC1B1                         631
#define ADCON2                        632
#define ADCS0                         633
#define ADCS                          634
#define ADCS1                         635
#define ADCS2                         636
#define ACQT0                         637
#define ACQT                          638
#define ACQT1                         639
#define ACQT2                         640
#define ADFM                          641
#define ADCON1                        642
#define PCFG0                         643
#define PCFG                          644
#define PCFG1                         645
#define PCFG2                         646
#define CHSN3                         647
#define PCFG3                         648
#define VCFG                          649
#define VCFG0                         650
#define VCFG01                        651
#define VCFG11                        652
#define VCFG1                         653
#define ADCON0                        654
#define ADON                          655
#define nDONE                         656
#define GO_nDONE                      657
#define NOT_DONE                      658
#define GODONE                        659
#define GO_DONE                       660
#define DONE                          661
#define GO_NOT_DONE                   662
#define GO                            663
#define CHS0                          664
#define CHS                           665
#define CHS1                          666
#define CHS2                          667
#define CHS3                          668
#define T2CON                         669
#define T2CKPS0                       670
#define T2CKPS                        671
#define T2CKPS1                       672
#define TMR2ON                        673
#define T2OUTPS0                      674
#define T2OUTPS                       675
#define T2OUTPS1                      676
#define T2OUTPS2                      677
#define T2OUTPS3                      678
#define PR2                           679
#define WM0                           680
#define WM1                           681
#define WAIT0                         682
#define WAIT1                         683
#define EBDIS                         684
#define T1CON                         685
#define TMR1ON                        686
#define TMR1CS                        687
#define NOT_T1SYNC                    688
#define T1SYNC                        689
#define nT1SYNC                       690
#define T1OSCEN                       691
#define SOSCEN                        692
#define T1CKPS0                       693
#define T1CKPS                        694
#define T1CKPS1                       695
#define T1RUN                         696
#define RD16                          697
#define T1RD16                        698
#define RCON                          699
#define BOR                           700
#define NOT_BOR                       701
#define nBOR                          702
#define POR                           703
#define nPOR                          704
#define NOT_POR                       705
#define PD                            706
#define nPD                           707
#define NOT_PD                        708
#define NOT_TO                        709
#define nTO                           710
#define TO                            711
#define nRI                           712
#define NOT_RI                        713
#define RI                            714
#define SBOREN                        715
#define nIPEN                         716
#define IPEN                          717
#define NOT_IPEN                      718
#define WDTCON                        719
#define SWDTE                         720
#define SWDTEN                        721
#define HLVDCON                       722
#define HLVDL                         723
#define HLVDL0                        724
#define LVV0                          725
#define LVDL0                         726
#define HLVDL1                        727
#define LVDL1                         728
#define LVV1                          729
#define HLVDL2                        730
#define LVV2                          731
#define LVDL2                         732
#define HLVDL3                        733
#define LVV3                          734
#define LVDL3                         735
#define HLVDEN                        736
#define LVDEN                         737
#define BGST                          738
#define IRVST                         739
#define IVRST                         740
#define VDIRMAG                       741
#define OSCCON                        742
#define SCS0                          743
#define SCS                           744
#define SCS1                          745
#define OSTS                          746
#define IDLEN                         747
#define T0CON                         748
#define T0PS                          749
#define T0PS0                         750
#define T0PS1                         751
#define T0PS2                         752
#define PSA                           753
#define T0SE                          754
#define T0CS                          755
#define T08BIT                        756
#define TMR0ON                        757
#define STATUS                        758
#define C                             759
#define CARRY                         760
#define DC                            761
#define ZERO                          762
#define Z                             763
#define OV                            764
#define OVERFLOW                      765
#define N                             766
#define NEGATIVE                      767
#define INTCON3                       768
#define INT1IF                        769
#define INT1F                         770
#define INT2IF                        771
#define INT2F                         772
#define INT1E                         773
#define INT1IE                        774
#define INT2IE                        775
#define INT2E                         776
#define INT1P                         777
#define INT1IP                        778
#define INT2IP                        779
#define INT2P                         780
#define INTCON2                       781
#define RBIP                          782
#define TMR0IP                        783
#define T0IP                          784
#define INTEDG2                       785
#define INTEDG1                       786
#define INTEDG0                       787
#define RBPU                          788
#define NOT_RBPU                      789
#define nRBPU                         790
#define INTCON                        791
#define RBIF                          792
#define INT0F                         793
#define INT0IF                        794
#define T0IF                          795
#define TMR0IF                        796
#define RBIE                          797
#define INT0E                         798
#define INT0IE                        799
#define T0IE                          800
#define TMR0IE                        801
#define PEIE                          802
#define PEIE_GIEL                     803
#define GIEL                          804
#define GIE_GIEH                      805
#define GIE                           806
#define GIEH                          807
#define STKPTR0                       808
#define STKPTR                        809
#define STKPTR1                       810
#define STKPTR2                       811
#define STKPTR3                       812
#define STKPTR4                       813
#define STKUNF                        814
#define STKOVF                        815
#define STKFUL                        816

#endif // _PIC18LF4450_H_
